Console.Clear();
//================================================================================================================================
// Задача 31: Задайте массив из 12 элементов, заполненный случайными числами из промежутка [-9, 9]. Найдите сумму отрицательных и положительных элементов массива.
// Например, в массиве [3,9,-8,1,0,-7,2,-1,8,-3,-1,6] сумма положительных чисел равна 29, сумма отрицательных равна -20.

// int[] array = new int[12];

// int resultPositive = 0;
// int resultNegative = 0;

// int i = 0;
// int arraySize = array.Length;

// while (i < arraySize)
// {
//     array[i] = new Random().Next(-9, 10);
//     i++;
// }
// Console.WriteLine($"Array: [{String.Join(", ", array)}]");

// for (int j = 0; j < arraySize; j++)
// {
//     if (array[j] < 0) resultNegative += array[j];
//     else resultPositive += array[j];
// }
// Console.WriteLine($"Сумма положительных чисел = {resultPositive}, Сумма отрицательных чисел = {resultNegative}");
//================================================================================================================================

// Задача 32: Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.
// [-4, -8, 8, 2] -> [4, 8, -8, -2] 

// int[] array = new int[10];
// int arraySize = array.Length;

// for (int i = 0; i < arraySize; i++)
// {
//      array[i] = new Random().Next(-20, 21);
// }
// Console.WriteLine($"Array: [{String.Join(", ", array)}]");

// for (int i = 0; i < array.Length; i++){
//     array[i] *= (-1);
// }
// Console.WriteLine($"Array: [{String.Join(", ", array)}]");

//================================================================================================================================

// Задача 33: Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.
// 4; массив [6, 7, 19, 345, 3] -> нет
// -3; массив [6, 7, 19, 345, 3] -> да

// int[] array = new int[5];
// int arraySize = array.Length;

// for (int i = 0; i < arraySize; i++)
// {
//     array[i] = new Random().Next(-20, 21);
// }
// Console.WriteLine($"Array: [{String.Join(", ", array)}]");

// int num = Convert.ToInt32(Console.ReadLine());
// bool find = false;

// for (int i = 0; i < arraySize; i++)
// {
//     if (array[i] == num)
//     {
//         find = true;
//         break;
//     }
// }
// if (find) Console.WriteLine($"Число : {num} присутствует в массиве");
// else Console.WriteLine($"Число : {num} отсутствует в массиве");

//================================================================================================================================

// Задача 35: Задайте одномерный массив из 123 случайных чисел. Найдите количество элементов массива, значения которых лежат в отрезке [10,99]. 
// Пример для массива из 5, а не 123 элементов. В своём решении сделайте для 123
// [5, 18, 123, 6, 2] -> 1
// [1, 2, 3, 6, 2] -> 0
// [10, 11, 12, 13, 14] -> 5

// int[] array = new int[123];
// int arraySize = array.Length;

// for (int i = 0; i < arraySize; i++)
// {
//     array[i] = new Random().Next(200);
// }
// Console.WriteLine($"Array: [{String.Join(", ", array)}]");
// int result = 0;
// for (int i = 0; i < array.Length; i++){
//  if (array[i] >= 10 && array[i] <=99) result++;
// }
// Console.WriteLine($"Количество искомых эл-в : {result}");

//================================================================================================================================
